app/src/main/assets/soap/request_bipro440-kunde.xml

<soapenv:Envelope xmlns:nam="http://www.bipro.net/namespace"
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
${soapHeader}
    <soapenv:Body>
        <nam:getLinks>
            <nam:Request Version="1.4.1.0">
                <nam:Extranetsuche>
                    <nam:Partnersuche>
                        <!--#IFDEF ${partnernummerVu}--><nam:PartnernummerVu>${partnernummerVu}</nam:PartnernummerVu><!--/#IFDEF-->
                        <!--#IFDEF ${name}--><nam:Name>${name}</nam:Name><!--/#IFDEF-->
                        <!--#IFDEF ${vorname}--><nam:Vorname>${vorname}</nam:Vorname><!--/#IFDEF-->
                        <!--#IFDEF ${strasse}--><nam:Strasse>${strasse}</nam:Strasse><!--/#IFDEF-->
                        <!--#IFDEF ${plz}--><nam:Postleitzahl>${plz}</nam:Postleitzahl><!--/#IFDEF-->
                        <!--#IFDEF ${ort}--><nam:Ort>${ort}</nam:Ort><!--/#IFDEF-->
                    </nam:Partnersuche>
                </nam:Extranetsuche>
            </nam:Request>
        </nam:getLinks>
    </soapenv:Body>
</soapenv:Envelope>